m = int(input())
nums = [1, 2, 3, 4, 5, 6, 7, 8, 9]

posnum = [
    [1, 12, 123, 1234, 12345, 123456, 1234567, 12345678],
    [2, 23, 234, 2345, 23456, 234567, 2345678, 23456789],
    [3, 34, 345, 3456, 34567, 345678, 3456789],
    [4, 45, 456, 4567, 45678, 456789],
    [5, 56, 567, 5678, 56789],
    [6, 67, 678, 6789],
    [7, 78, 789],
    [8, 89],
    [9]
]

# Следующее число должно начинаться с (последняя цифра конечного числа + 1)
# По индексу это будет (последняя цифра конечного числа)

for i in range(9**9)



